# დავალება 1
# მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
# --> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
# --> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
# --> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'
number_1=float(input("შეიყვანე რიცხვი:"))
if number_1>0:
    print("ეს რიცხვი დადებითია")
elif number_1<0:
    print("ეს რიცხვი უარყოფითია")
else:print("ეს რიცხვი ნულის ტოლია")

# დავალება 2
# მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'
age=int(input("შეიყვანე ასაკი:"))
if 0<age<=12:
    print("ბავშვი ხარ")
elif 13<=age<=19:
    print("მოზარდი/თინეიჯერი ხარ")
elif 20<=age<=64:
    print("ზრდასრული ხართ")
elif 65<=age<=120:
    print("ხანში შესული ხართ")
elif age>120:
    print("გურუ ან ჯადოქარი")
else: print("არასწორი ინფო")

# დავალება 3
# დაწერეთ "password guesser" პროგრამა, შექმენით რაიმე ცვლადი და მასში შეინახეთ ის პაროლი რომელსაც ყველგან იყენებთ ;)
# მომხმარებელს მოთხოვეთ გამოიცნოს თქვენი პაროლი
# აღნიშნეთ ცდების რაოდენობა
# გამოიყენეთ while loop, მანამ ატრიალეთ სანამ მომხმარებელი პაროლს არ გამოიცნობს ან დაწერს --> 'nah strong password'
# ბოლოს აჩვენეთ(დაუპრინტეთ) რამდენი ცდა დაჭირდა პაროლის გამოსაცნობად
password="GOA"
guess_pass=input("guess my password:")
count=0
while password!=guess_pass:
    guess_pass=input("enter again:")
    count+=1
print("you needed"+ str(count) +"tries")

# დავალება 4 
# მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი
num_1=float(input("enter first number:"))
num_2=float(input("enter second number:"))
num_3=float(input("enter third number:"))
if num_1<num_2<num_3:
    print(num_3)
elif num_1<num_3<num_2:
    print(num_2)
else:print(num_1)

# დავალება 5
# შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'
choice=int(input("enter number:"))
if choice==1:
    print("monday")
elif choice==2:
    print("tuesday")
elif choice==3:
    print("wednesday")
elif choice==4:
    print("thursday")
elif choice==5:
    print("friday")
elif choice==6:
    print("saturday")
elif choice==7:
    print("sunday")
else:print("i don't know what day it is")