# for ციკლის მეშვეობით გამოიტანეთ რიცხვები 10-ის ჩათვლით
for i in range(11):
    print(i)

# while ციკლის მეშვეობით გამოიტანეთ რიცხვები 5-დან 20-მდე.
i=5
while i<20:
    print(i)
    i=i+1

# კომენტარების სახით ახსენით რა არის conditional statement, რა დანიშნულება გააჩნიათ და როგორი სახის განცხადებები გვაქვს.
# პირობითი წინადადება if/else if ფუნქცია თუ სრულდება ესეიგი ჭეშმარიტია თუ არადა გამოდის else ფუნქცია.

# მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ თუ ასაკი იქნება მეტი ან ტოლი 18-ის 
# მაშინ გამოუტანოს რომ იგი ზრდასრულია, ხოლო თუ იქნება 18-ზე ნაკლები საბოლოო გზის მეშვეობით გამოუტანეთ რომ ის მოზარდია.

age=int(input("enter your age:"))
if age>18:
    print("You are an adult")
else:print("You are a teenager")
