# დავალება 1
# მოიყვანეთ აბსოლიტურად ყველა მათემატიკურ  ოპერატორზე სამ სამი მაგალითი ძველებზეც და ახლებზეც

# multiplication
print(9*4 , 8*7 , 6*0)

# division
print(8/2 , 9/3 , 8/4)

# addition
print(8+6 , 9+4 , 8+2)

# Subtraction 
print(9-8 , 8-9 , 7-8)

# //
print(4//2 , 5//2 , 16//3)

# **
print(7**2 , 4**7 , 3**3)

# %
print(7%4 , 5%2 , 99%67)

# დავალება 2
# კომენტარის სახით ახსენით თუ რა მათემატიკური ოპერაციები ვისწალეთ დღეს და სიტყვიერად დაწერეთ თუ რას აკეთებენ ისინი
# // - იგივე გაყოფა მაგრამ რამდენჯერ თავსდება ის გამოაქვს ტერმინალზე 
# ** - ხარისხი
# % - ნაშთიანი გაყოფა

# დავალება 3
# დღეს ახსნილ მათემატიკურ ოპერატორებზე სათითაოდ მოიყვანეთ ხუთ ხუთი მაგალითი , ანუ სულ 15 მაგალით უნდა გქონდეთ

# //
print(8//6 , 7//2 , 18//5 , 23//4 , 67//33)

# **
print(6**2 , 4**5 , 4**7 , 3**4 , 7*5)

# %
print(67%45 , 36&5 , 38%6 , 89%35 , 49&17)

# დავალება 4
# ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:
    #  15 / 3 = 
print(15/3)
    #  20 / 4 = 
print(20/4)
    #  100 / 20 = 
print(100/20)

    #  15 // 10 = 
print(15//10)
    #  10 // 7 =
print(10//7)
    #  40 // 12 = 
print(40//12)

    #  4 * 3 = 
print(4*3)
    #  40 * 3 = 
print(40*3)
    #  120 * 3 = 
print(120*3)

    #  4 ** 3 = 
print(4**3)
    #  10 ** 3 = 
print(10**3)
    #  2 ** 6 = 
print(2**6)
    #  3 ** 4 = 
print(3**4)

    #  10 % 7 = 
print(10%7)
    #  3 % 2 = 
print(3%2)
    #  50 % 25 = 
print(50%25)
    #  14 % 11 = 
print(14%11)
    #  110 % 50 = 
print(110%50)

# დავალება 5
# კომენტარის სახით დაწერეთ თუ რაში ვიყენებთ სიებს,და რით განსხვავდებიან ისინი ცვლადებისაგან
# list -ები ცვლადებისგან იმით განსხვავდებიან რომ მეტი მონაცემის შენახვა შეგვიძლია

# დავალება 6
# შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ სტრინგ ტიპის მონაცემები
list_1=["dog","cat","owl","ox"]

# დავალება 7
# შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ინტეჯერ ტიპის მონაცემები
list_2=[5,9,40,29]

# დავალება 8
# შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ ფლოატ ტიპის მონაცემები
list_3=[3.14,5.9,6.7,5.89]

# დავალება 9
# შექმენი სია,შეინახე ეს სია ცვლადში და ამ სიაში შეინახეთ მხოლოდ boolean ტიპის მონაცემები
list_4=[True,False]

# დავალება 10
# შექმენით სია,შეინახეთ ეს სია ცვლადში და ამ სიაში შეინახეთ ყველა მონაცემთა ტიპის მონაცემი
list_5=["string",50,6.4,True]

# ---------------------------------------BONUS--------------------------------------- #
# დავალება 11
# მომხმარებელს შემოატანინეთ ორი რიცხვი და მოახდინეთ ამ ორ რიცხხვზე დღეს ნასწავლი მათემატიკური ოპერაციები(თან დაპრინტეთ რომ ნახოთ შედეგი)
num_1=float(input("Enter first number:"))
num_2=float(input("Enter second number:"))
print(num_1//num_2)
print(num_1**num_2)
print(num_1%num_2)

# დავალება 12
# მომხმარებელს შემოატანინეთ ინტეჯერ ტიპის მონაცემი, შემდეგ შეამოწმეთ, თუ მომხმარებლის შემოყვანილი 
# რიცხვი არის 30 ზე მეტი და 100ზე ნაკლები დაუპრინტე --> "between 30 and 100", 
# თუ ეს რიცხვი არის 100 ზე მეტი და 200 ზე ნაკლები დაუპრინტე --> "between 100 and 200" , 
# სხვა დანარჩენ შემთხვევაში დაუპრინტე  --> "other number"
num_3=int(input("Enter random number:"))
if 30<num_3<100:
    print("between 30 and 100")
elif 100<num_3<200:
    print("between 100 and 200")
else: print("other number")

# დავალება 13
# შექმენი 5 ცვლადი შეინახე განსხვავებული ტიპის მონაცემები და დაპრინტე მათი ტიპები(გამოიყენეტ ნასწავლი ფუნქცია)
variable_1="people"
variable_2=20
variable_3=3.14
variable_4=True
variable_5=False
print(type(variable_1))
print(type(variable_2))
print(type(variable_3))
print(type(variable_4))
print(type(variable_5))

# დავალება 14
# while ციკლის დახმარებით გამოიტანეთ რიცხვები 50 დან 100 მდე 5 ის გამოტოვებით --> 50 55 60
i=50
while i<100:
    print(i)
    i=i+5

# დავალება 15
# for ციკლის დახმარებით გამოიტანეთ რიცხვები 40 დან 90 მდე 3 ის გამოტოვებით -- > 40 43 46 
for i in range(40,90,3):
    print(i)

# დავალება 16
# გამოიტანე შენი სახელი და გვარი 15 ჯერ,გააკეთე ორივე ვარიანტით როგორც for ასევე while loop ის დახმარებით
for i in range(15):
    print("babi mikeladze")

i=1
while i<15:
    print("babi mikeladze")
    i=i+1

# დავალება 17
# შექმენი ცვლადი სადაც შეინახავ შენს სახელს
# შექმენი ცვლადი სადაც შეინახავ შენს გვარს
# მომხმარებელს შემოატანინეთ სახელი
# თუ მომხმარებელმა შემოიტანა იგივე სახელი რაც შენ გქვია მაშინ:
#       მომხმარებელს შემოატანინე გვარი
#       თუ მომხმარებლის შემოტანილი გვარი დაემთხვა შენს გვარს
#             დაპრინტე --> same name and surname
#       სხვა შემთხვევაში
#             დაპრინტე -- > same name but different surname
# სხვა შემთხვევაშში(ანუ თუ მომხმარებელი თავიდანვე შემოიყვანს არასწორ სახელს)
#     დაპრინტე --> aqedan moshordi
name_1="babi"
surname_1="mikeladze"
name_2=input("Enter your name:")
if name_1==name_2:
    surname_2=input("Enter your surname:")
    if surname_1==surname_2:
        print("same name and surname")
    else:print("same name but different surname")
else:print("Get out of here")

# დავალება 18
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი
password_1="goa123"
password_2=input("Enter your password:")
while True:
    if password_1==password_2:
        print("You guessed it right")
        break
    else:
        while password_1!=password_2:
            input("Enter again:")

