# დავალება 1
# დაატრიალეთ for ციკლი 0 დან 38 ის ჩათვლით და გამოიტანე თითოეული რიცხვი ტერმინალში 
for i in range(39):
    print(i)

# დავალება 2
# დაატრილეთ for ციკლი 30 დან 40 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში 
for i in range(30 , 40):
    print(i)

# დავალება 3 
# დაატრიალეთ for ციკლი 12 იდან 120 მდე  და გამოიტანე თითოეული რიცხვი ტერმინალში
for i in range(12 , 120):
    print(i)

# დავალება 4
# დაატრიალეთ for ციკლი და გამოიტანეთ თქვენი სახელი 18 ჯერ ასევე
# გამოიტანეთ თქვენი ასაკიც,ერთ for ციკლში მოათავსეთ ორივე და ეგრე გააკეთეთ
for i in range(18):
    print(str(16)+"babi")

# დავალება 5 
# დაატრიალეთ for ციკლი 10 დან 100 მდე 3 step ის გამოტოვებით და გამოიტანეთ თითოეული რიცხვი ტერმინალში
for i in range(10,100,3):
    print(i)

# დავალება 6
# ტერმინალში გამოიტანეთ თქვენი საყვარელი ხილის სახელი 30 ჯერ და თან დანომრეთ ,მიიღეთ ქვემოთ მოცემულის ნაირი შედეგი

# 1 ფორთოხალი
# 2 ფორთოხალი
# 3 ფორთოხალი
# 4 ფორთოხალი
# 5 ფორთოხალი
# .... 
# ....
# ....
# 30 ფორთოხალი
fruit="apple"
for i in range(1,31):
    print(str(i) + fruit)

# დავალება 7
# მომხმარებელს შემოატანინეთ მისი ასაკი 13 ჯერ გამოიყენე for loop
for i in range(13):
    print(int(input("enter your age:")))

# დავალება 8
# გამოიტანეთ თქვენი სახელი 10 ჯერ while loop ის გამოყენებით
i=0
while i<10:
    print("babi")
    i=i+1

# დავალება 9
# დაითვალეთ 0 დან 24 მდე გამოიყენეთ while loop
i=0
while i<25:
    print(i)
    i=i+1

# დავალება 10
# იმუშაოვეთ ბევრი for და while loop ებზე მოიყვანეთ თქვენით მაგალითები სურვილისამებრ
i=10
while i<30:
    print("dog")
    i=i+2

i=1
while i<20:
    print(i)
    i=i+5

i=0
while i<6:
    print("dance")
    i=i+3

i=5
while i<50:
    print("random")
    i=i+15



