# დავალება 1
# მომხმარებელს შემოატანინეთ ორი რიცხვი,შეამოწმეთ თუ პირველი რიცხვი მეტია მეორე რიცხვზე დაპრინტე რომ ‘first is more than second’,
# ასევე შეამოწმე თუ პირველი რიცხვი ნაკლებია მეორე რიცხვზე დაპრინტე რომ ‘first is less than second’ და სხვა დანარჩენ შემთხვევაში დაპტინტე
# რომ ‘first number equal to second number’
num_1=float(input("enter first number:"))
num_2=float(input("enter second number:"))
if num_1>num_2:
    print("first is more than second")
elif num_2>num_1:
    print("first is less than second")
else: print("first is equal to second number ")

# დავალება 2
# მომხმარებელს შემოატანინე რაიმე სტრინგი,ასევე შექმენი ცვლადი სადაც შეინახავთ თქვენს სახელს,
# შემდეგ შეამოწმე თუ მომხმარებლის შემოყვანილი სტრინგი უდრის შენა სახელს დაუპრინტე რომ ‘სეხნიები ვართ’ სხვა შემთხვევაში დაუპრინტეთ რომ ‘სხვადასხვა სახელები გავქვს’
name=input("enter your name:")
name_1="babi"
if name==name_1:
    print("სეხნიები ვართ")
else:print("სხვადასხვა სახელები გვაქვს")

# დავალება 3
# შექმენი ორი ცვლადი სადაც შეინახავთ ინტეჯერ ტიპოს მონაცემებს,თქვენი დავალებაა შეამოწმოთ,თუ პირველი რიცხვი მეტია 0 ზე და და მეორე რიცხვიც მეტია 0 ზე დაუპრინტე რომ
# ‘ორივე რიცხვი დადებითია,ასევე შეამოწმე თუ პირველი რიცხვი ნაკლებია 0 ზე და მეორე რიცხვიც ნაკლებია 0 ზე დაპურინტე რომ
# ‘ორივე რიცხვი არის უარყოფით’,სხვა დანარჩენ შემთხვევაში დაუპრინტე რომ ‘ეს რა ჯანდაბაა’
number_1=30
number_2=-6
if number_1>0 and number_2>0:
    print("both of them are positive")
elif number_1<0 and number_2<0:
    print("both of them are negative")
else:print("idk what is this")

# დავალება 4
# დაატრიალეთ ფორ ლუპი 50 დან 100 მდე 2 ის გამოტივებით 
for i in range(50,100,2):
    print(i)

# დავალება 5
# ვაილ ლუპის გამოყენებით 20 დან 40 მდე გამოიტანეთ ყველა რიცხვი
i=20
while i<40:
    print(i)
    i+=1
